upstream/OpenFOAM-v2606/tutorials/mesh/moveDynamicMesh/rotorDisk_inclined/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "slip.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"

    movingZone
    {
        type            solidBodyMotionDisplacement;
        solidBodyMotionFunction  rotatingMotion;
        rotatingMotionCoeffs
        {
            origin        (0 0 0);
            axis          (1 0 0);
            omega         #eval {degToRad(5)}; //theta*Time, 1s, 5deg in rad
        }
    }

    movingZoneEdges
    {
        type            slip;
    }
}


// ************************************************************************* //
